function Rho = GetPerigee(E, h, r0)
%GetPerigee (P,h) Нахождения начальных условий для решения уравнения движения.
%   Входные параметры:
%   E   - значение интеграла энергии,
%   h   - значение интеграла площадей.
%   r0  - значение параметра модели потенциала 
%
%   Выходные параметры:
%   Rho - расстояние от центра скопления до звезды,

%'r^6*(4*E^2) + r^4*(4*E^2*r0^2 - 4*r0^2 - 4*E*h^2) + r^2*(h^4 - 4*E*h^2*r0^2) + h^4*r0^2'

p = [4*E^2, 4*E^2*r0^2 - 4*r0^2 - 4*E*h^2, h^4 - 4*E*h^2*r0^2, h^4*r0^2];

%p = [4/r0^2, 4*E - 4*r0^2 - 4*(E^(1/2)/r0^(1/2))*h^2, h^4 - 4*E^(1/2)*h^2, h^4*r0^2];
rp = roots(p);

[i tt] = size(rp);

if (i > 0)
    r = [];
    for j = 1:i
        if (rp(j) > 0)
            a = sqrt(rp(j));
            r = [r a];
        end;
    end;
end;

Rho = min(r);

end